# Mandatory Challenge
## Context
You work in the data analysis team of a very important company. On Monday, the company shares some good news with you: you just got hired by a major retail company! So, let's get prepared for a huge amount of work!

Then you get to work with your team and define the following tasks to perform:   
1. You need to start your analysis using data from the past.  
2. You need to define a process that takes your daily data as an input and integrates it.  

You are in charge of the second part, so you are provided with a sample file that you will have to read daily. To complete you task, you need the following aggregates:
* One aggregate per store that adds up the rest of the values.
* One aggregate per item that adds up the rest of the values.

You can import the dataset `retail_sales` from Ironhack's database. 

## Your task
Therefore, your process will consist of the following steps:
1. Read the sample file that a daily process will save in your folder. 
2. Clean up the data.
3. Create the aggregates.
4. Write three tables in your local database: 
    - A table for the cleaned data.
    - A table for the aggregate per store.
    - A table for the aggregate per item.

## Instructions
* Read the csv you can find in Ironhack's database.
* Clean the data and create the aggregates as you consider.
* Create the tables in your local database.
* Populate them with your process.

In [4]:
# your code here
import pandas as pd 
from sqlalchemy import create_engine
import pymysql

In [5]:
driver = 'mysql+pymysql'
ip = '34.65.10.136'
username = 'data-students'
password = 'iR0nH@cK-D4T4B4S3'
db = 'retail_sales'
connection_string  = f'{driver}://{username}:{password}@{ip}/{db}'

In [6]:
engine = create_engine(connection_string) #function from sqlalchemy, engine object
query = 'SELECT * FROM raw_sales'

In [7]:
raw_sales = pd.read_sql(query,engine)
raw_sales

           date  shop_id  item_id  item_price  item_cnt_day
0    2015-01-04       29     1469      1199.0           1.0
1    2015-01-04       28    21364       479.0           1.0
2    2015-01-04       28    21365       999.0           2.0
3    2015-01-04       28    22104       249.0           2.0
4    2015-01-04       28    22091       179.0           1.0
...         ...      ...      ...         ...           ...
4540 2015-01-04       15     4240      1299.0           1.0
4541 2015-01-04       14    21922        99.0           1.0
4542 2015-01-04       15     1969      3999.0           1.0
4543 2015-01-04       14    22091       179.0           1.0
4544 2015-01-04       15     1007      1199.0           1.0

[4545 rows x 5 columns]

In [18]:
sales_copy = raw_sales.copy()
sales_copy

           date  shop_id  item_id  item_price  item_cnt_day
0    2015-01-04       29     1469      1199.0           1.0
1    2015-01-04       28    21364       479.0           1.0
2    2015-01-04       28    21365       999.0           2.0
3    2015-01-04       28    22104       249.0           2.0
4    2015-01-04       28    22091       179.0           1.0
...         ...      ...      ...         ...           ...
4540 2015-01-04       15     4240      1299.0           1.0
4541 2015-01-04       14    21922        99.0           1.0
4542 2015-01-04       15     1969      3999.0           1.0
4543 2015-01-04       14    22091       179.0           1.0
4544 2015-01-04       15     1007      1199.0           1.0

[4545 rows x 5 columns]

In [24]:
#cleaning data 
sales_copy.isnull().sum().sum()

0

In [23]:
sales_copy["revenue_day"] = sales_copy["item_price"]*sales_copy["item_cnt_day"]
sales_copy[["revenue_day"]]

      revenue_day
0          1199.0
1           479.0
2          1998.0
3           498.0
4           179.0
...           ...
4540       1299.0
4541         99.0
4542       3999.0
4543        179.0
4544       1199.0

[4545 rows x 1 columns]

In [25]:
sales_copy

           date  shop_id  item_id  item_price  item_cnt_day  revenue_day
0    2015-01-04       29     1469      1199.0           1.0       1199.0
1    2015-01-04       28    21364       479.0           1.0        479.0
2    2015-01-04       28    21365       999.0           2.0       1998.0
3    2015-01-04       28    22104       249.0           2.0        498.0
4    2015-01-04       28    22091       179.0           1.0        179.0
...         ...      ...      ...         ...           ...          ...
4540 2015-01-04       15     4240      1299.0           1.0       1299.0
4541 2015-01-04       14    21922        99.0           1.0         99.0
4542 2015-01-04       15     1969      3999.0           1.0       3999.0
4543 2015-01-04       14    22091       179.0           1.0        179.0
4544 2015-01-04       15     1007      1199.0           1.0       1199.0

[4545 rows x 6 columns]

In [36]:
shop_id = sales_copy.groupby("shop_id").sum()
shop_id

         item_id  item_price  item_cnt_day  revenue_day
shop_id
2         966879    99070.50          81.0     103746.0
3         335745    67443.00          33.0      67443.0
4         498624    29361.00          39.0      29361.0
5         620868    33138.00          45.0      33138.0
6        1266894   116352.00         150.0     138678.0
7         669045    52371.00          63.0      52371.0
10        310137    22707.00          30.0      22716.0
12       1647339   212196.40         216.0     295173.0
14        421977    33456.00          51.0      57450.0
15       1210026   125139.00          93.0     125139.0
16        704436   119526.00          66.0     121923.0
18        798573    35391.00          96.0      35787.0
19        500601    61008.00          60.0      51420.0
21       1758747   224818.50         180.0     228999.0
22        894054   124665.00         141.0     150717.0
24        598098    56955.00          69.0      56955.0
25       3282900   281796.00         312.0     288432.0
26       1282839   119025.00         111.0     120462.0
27       1936338   156324.00         180.0     172959.0
28       2424117   175614.00         246.0     202512.0
29        884454    85737.00          72.0      85737.0
31       3896166   268098.00         402.0     304692.0
34        334746    12117.00          18.0      12117.0
35        809610    89337.00          84.0      65769.0
37        778842   212103.00          63.0     220500.0
38        444330    73482.00          66.0      73482.0
39        819180    30369.00          54.0      34686.0
41        427194    36840.00          30.0      36840.0
42       3004773   327864.00         249.0     330111.0
44        602433   143070.00          51.0     137445.0
45        762702    49107.00          96.0      82350.0
46       1108329    93185.40          99.0      93903.0
47        757767    80142.00          78.0      80142.0
48        673335    32745.00          63.0      32745.0
49        452067    35784.00          33.0      35784.0
50        617757   142008.00          69.0     142053.0
51        200076     9285.00          24.0      10665.0
52        620196    65512.02          72.0      63531.0
53        799296    49893.00          78.0      50505.0
54       2058129   119352.00         195.0     125343.0
55        854331    72612.60         180.0     170847.6
56        667113    47109.00          75.0      54906.0
57       3976677   219234.00         324.0     226269.0
58       1880592   135318.00         168.0     142863.0
59       1075056   112353.00         111.0     113109.0

In [37]:
shop_id.drop(["item_id", "item_price"], axis = 1)

         item_cnt_day  revenue_day
shop_id
2                81.0     103746.0
3                33.0      67443.0
4                39.0      29361.0
5                45.0      33138.0
6               150.0     138678.0
7                63.0      52371.0
10               30.0      22716.0
12              216.0     295173.0
14               51.0      57450.0
15               93.0     125139.0
16               66.0     121923.0
18               96.0      35787.0
19               60.0      51420.0
21              180.0     228999.0
22              141.0     150717.0
24               69.0      56955.0
25              312.0     288432.0
26              111.0     120462.0
27              180.0     172959.0
28              246.0     202512.0
29               72.0      85737.0
31              402.0     304692.0
34               18.0      12117.0
35               84.0      65769.0
37               63.0     220500.0
38               66.0      73482.0
39               54.0      34686.0
41               30.0      36840.0
42              249.0     330111.0
44               51.0     137445.0
45               96.0      82350.0
46               99.0      93903.0
47               78.0      80142.0
48               63.0      32745.0
49               33.0      35784.0
50               69.0     142053.0
51               24.0      10665.0
52               72.0      63531.0
53               78.0      50505.0
54              195.0     125343.0
55              180.0     170847.6
56               75.0      54906.0
57              324.0     226269.0
58              168.0     142863.0
59              111.0     113109.0

In [42]:
item_id = sales_copy.groupby("item_id").sum()
item_id.drop(["shop_id", "revenue_day"], axis=1)

         item_price  item_cnt_day
item_id
30            507.0           3.0
31           1089.0           3.0
32            447.0           3.0
42            897.0           3.0
59            747.0           3.0
...             ...           ...
22091        1074.0           6.0
22092         537.0           3.0
22104         747.0           6.0
22140         652.5           3.0
22162        5985.0          18.0

[985 rows x 2 columns]